brew "perl"               # scripting lang used by a lot of other packages
brew "git"                # version control
brew "fzf"                # fuzzy finder
brew "lf"                 # file explorer
brew "rbenv"              # ruby environment manager
brew "ripgrep"            # rg: file and file content search
brew "tmux"               # terminal multiplexer
brew "neovim"             # fork of vim
brew "pandoc"             # ultimate markdown processor
brew "pandoc-crossref"    # for making references to sections/figs in pandoc
brew "tree"               # see tree structure of directories
brew "git-subrepo"        # Git Submodule Alternative
brew "shfmt"              # Autoformat shell script source code
brew "the_silver_searcher" # ag, file and file-content search
brew "hugo"               # static site generator
brew "git-filter-repo"    # Quickly rewrite git repository history
brew "grip"               # Markdown previewer
brew "ffmpeg"             # video and audio processor
brew "gnupg"              # for PGP
brew "yt-dlp"             # for downloading youtube videos
brew "diff-pdf"           # for diffing pdfs
brew "wget"               # for downloading files
brew "graphviz"           # i think this was for pdf stuff
brew "git-lfs"            # large files on git
brew "rename"             # Perl-powered file rename script with many helpful built-ins
brew "watchman"           # Watch files and take action when they change
brew "pv"                 # monitor progress of data through a pipe
brew "ctags"              # exuberant ctags, use for vim tagbar

